zup/ЗУП_бюджет/src/Catalogs/ЭлементыКлассификаторовМедРегистра/ЭлементыКлассификаторовМедРегистра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлементыКлассификаторовМедРегистра</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.КлассификаторыМедРегистра</owners>
</mdclass:Catalog>

zup/ЗУП_бюджет/src/Catalogs/КлассификаторыМедРегистра/КлассификаторыМедРегистра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассификаторыМедРегистра</name>
  <predefined>
    <items>
      <name>ArrayOfYesNo</name>
      <description>Варианты ответов (Да, Нет)</description>
    </items>
    <items>
      <name>ArrayOfNomenclature</name>
      <description>Виды деятельности медицинских организаций</description>
    </items>
    <items>
      <name>ArrayOfDocumentType</name>
      <description>Виды документов, удостоверяющих личность</description>
    </items>
    <items>
      <name>ArrayOfPositionType</name>
      <description>Виды занятости</description>
    </items>
    <items>
      <name>ArrayOfMedicalCare</name>
      <description>Виды медицинской помощи</description>
    </items>
    <items>
      <name>ArrayOfEducationType</name>
      <description>Виды образования</description>
    </items>
    <items>
      <name>ArrayOfPostGraduationEducationType</name>
      <description>Виды послевузовского образования</description>
    </items>
    <items>
      <name>ArrayOfCitizenship</name>
      <description>Гражданство</description>
    </items>
    <items>
      <name>ArrayOfNomination</name>
      <description>Звания и награды</description>
    </items>
    <items>
      <name>ArrayOfPosition</name>
      <description>Категории должностей</description>
    </items>
    <items>
      <name>ArrayOfQualificationCategory</name>
      <description>Квалификационные категории</description>
    </items>
    <items>
      <name>ArrayOfSkipPaymentReason</name>
      <description>Неявки</description>
    </items>
    <items>
      <name>ArrayOfRecordTypeOutDel</name>
      <description>Основания увольнения</description>
    </items>
    <items>
      <name>ArrayOfMilitary</name>
      <description>Отношение к воинской обязанности</description>
    </items>
    <items>
      <name>ArrayOfAbsenceType</name>
      <description>Отпуска и командировки</description>
    </items>
    <items>
      <name>ArrayOfRegime</name>
      <description>Режимы работы</description>
    </items>
    <items>
      <name>ArrayOfMarriage</name>
      <description>Семейное положение</description>
    </items>
    <items>
      <name>ArrayOfSpeciality</name>
      <description>Специальности</description>
    </items>
    <items>
      <name>ArrayOfCertificateSpeciality</name>
      <description>Специальности сертификации</description>
    </items>
    <items>
      <name>ArrayOfCountry</name>
      <description>Станы мира</description>
    </items>
    <items>
      <name>ArrayOfTerritory</name>
      <description>Субъекты РФ</description>
    </items>
    <items>
      <name>ArrayOfPost</name>
      <description>Типовые должности</description>
    </items>
    <items>
      <name>ArrayOfSubdivision</name>
      <description>Типовые подразделения</description>
    </items>
    <items>
      <name>ArrayOfRecordTypeMoveInOrg</name>
      <description>Типы движений кадров внутри организации начала записи</description>
    </items>
    <items>
      <name>ArrayOfRecordTypeMoveOutOrg</name>
      <description>Типы движений кадров внутри организации окончание записи</description>
    </items>
    <items>
      <name>ArrayOfRecordTypeIn</name>
      <description>Типы начала записи</description>
    </items>
    <items>
      <name>ArrayOfRecordTypeInAdd</name>
      <description>Типы начала записи дополнительно</description>
    </items>
    <items>
      <name>ArrayOfRecordTypeInStudType</name>
      <description>Типы начала записи после обучения</description>
    </items>
    <items>
      <name>ArrayOfRecordTypeOut</name>
      <description>Типы окончания записи</description>
    </items>
    <items>
      <name>ArrayOfLevel</name>
      <description>Уровни ЛПУ</description>
    </items>
    <items>
      <name>ArrayOfMedicalCondition</name>
      <description>Условия оказания медицинской помощи</description>
    </items>
    <items>
      <name>ArrayOfEducationInstitution</name>
      <description>Учебные заведения</description>
    </items>
    <items>
      <name>ArrayOfAcademicDegree</name>
      <description>Ученые степени</description>
    </items>
  </predefined>
</mdclass:Catalog>

zup/ЗУП_бюджет/src/Catalogs/ЭлементыКлассификаторовМедРегистра/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает реквизиты справочника, которые образуют естественный ключ
//  для элементов справочника.
// Используется для сопоставления элементов механизмом «Выгрузка/загрузка областей данных».
//
// Возвращаемое значение: Массив(Строка) - массив имен реквизитов, образующих
//  естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("Владелец");
	Результат.Добавить("Код");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает структуру гражданства в мед. регистре.
//
Функция ГражданствоМедицинскихРаботников() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЭлементыКлассификаторовМедРегистра.Ссылка,
	|	ВЫБОР
	|		КОГДА ЭлементыКлассификаторовМедРегистра.Код = ""1""
	|			ТОГДА ""ГражданинРоссии""
	|		КОГДА ЭлементыКлассификаторовМедРегистра.Код = ""3""
	|			ТОГДА ""ИностранныйГражданин""
	|		КОГДА ЭлементыКлассификаторовМедРегистра.Код = ""4""
	|			ТОГДА ""БезГражданства""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Код
	|ИЗ
	|	Справочник.ЭлементыКлассификаторовМедРегистра КАК ЭлементыКлассификаторовМедРегистра
	|ГДЕ
	|	ЭлементыКлассификаторовМедРегистра.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Справочники.КлассификаторыМедРегистра.ArrayOfCitizenship);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Гражданство = Новый Структура("ГражданинРоссии, ИностранныйГражданин, БезГражданства");
	
	Пока Выборка.Следующий() Цикл 
		
		Если ПустаяСтрока(Выборка.Код ) Тогда
			Продолжить;
		КонецЕсли;
		
		Гражданство.Вставить(Выборка.Код, Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат Гражданство;
	
КонецФункции	

Функция КлючевыеХарактеристикиКадровойИстории() Экспорт

	КлючевыеХарактеристики = Новый Структура;
	КлючевыеХарактеристики.Вставить("Прием");
	КлючевыеХарактеристики.Вставить("НачалоВнутреннееПеремещение");
	КлючевыеХарактеристики.Вставить("ПриемПослеОбучения");
	КлючевыеХарактеристики.Вставить("ПриемИзДругогоСубъектаРФ");
	КлючевыеХарактеристики.Вставить("ПриемИзДругойСтраны");
	КлючевыеХарактеристики.Вставить("ОкончаниеВнутреннееПеремещение");
	КлючевыеХарактеристики.Вставить("УволенПоУсловиямДоговора");
	КлючевыеХарактеристики.Вставить("УволенПоСобственномуЖеланию");
	КлючевыеХарактеристики.Вставить("ВыбылВДругуюСтрану");
	КлючевыеХарактеристики.Вставить("ВыбылВДругойСубъектРФ");
	КлючевыеХарактеристики.Вставить("ОкончаниеТрудовогоДоговора");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	""Прием"" КАК Ключ,
	|	ЭлементыКлассификаторовМедРегистра.Ссылка КАК Значение
	|ИЗ
	|	Справочник.ЭлементыКлассификаторовМедРегистра КАК ЭлементыКлассификаторовМедРегистра
	|ГДЕ
	|	ЭлементыКлассификаторовМедРегистра.Код = ""9""
	|	И ЭлементыКлассификаторовМедРегистра.Владелец = ЗНАЧЕНИЕ(Справочник.КлассификаторыМедРегистра.ArrayOfRecordTypeIn)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""НачалоВнутреннееПеремещение"",
	|	ЭлементыКлассификаторовМедРегистра.Ссылка
	|ИЗ
	|	Справочник.ЭлементыКлассификаторовМедРегистра КАК ЭлементыКлассификаторовМедРегистра
	|ГДЕ
	|	ЭлементыКлассификаторовМедРегистра.Код = ""8""
	|	И ЭлементыКлассификаторовМедРегистра.Владелец = ЗНАЧЕНИЕ(Справочник.КлассификаторыМедРегистра.ArrayOfRecordTypeIn)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ПриемПослеОбучения"",
	|	ЭлементыКлассификаторовМедРегистра.Ссылка
	|ИЗ
	|	Справочник.ЭлементыКлассификаторовМедРегистра КАК ЭлементыКлассификаторовМедРегистра
	|ГДЕ
	|	ЭлементыКлассификаторовМедРегистра.Код = ""2""
	|	И ЭлементыКлассификаторовМедРегистра.Владелец = ЗНАЧЕНИЕ(Справочник.КлассификаторыМедРегистра.ArrayOfRecordTypeInAdd)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ПриемИзДругогоСубъектаРФ"",
	|	ЭлементыКлассификаторовМедРегистра.Ссылка
	|ИЗ
	|	Справочник.ЭлементыКлассификаторовМедРегистра КАК ЭлементыКлассификаторовМедРегистра
	|ГДЕ
	|	ЭлементыКлассификаторовМедРегистра.Код = ""3""
	|	И ЭлементыКлассификаторовМедРегистра.Владелец = ЗНАЧЕНИЕ(Справочник.КлассификаторыМедРегистра.ArrayOfRecordTypeInAdd)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ПриемИзДругойСтраны"",
	|	ЭлементыКлассификаторовМедРегистра.Ссылка
	|ИЗ
	|	Справочник.ЭлементыКлассификаторовМедРегистра КАК ЭлементыКлассификаторовМедРегистра
	|ГДЕ
	|	ЭлементыКлассификаторовМедРегистра.Код = ""4""
	|	И ЭлементыКлассификаторовМедРегистра.Владелец = ЗНАЧЕНИЕ(Справочник.КлассификаторыМедРегистра.ArrayOfRecordTypeInAdd)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ОкончаниеВнутреннееПеремещение"",
	|	ЭлементыКлассификаторовМедРегистра.Ссылка
	|ИЗ
	|	Справочник.ЭлементыКлассификаторовМедРегистра КАК ЭлементыКлассификаторовМедРегистра
	|ГДЕ
	|	ЭлементыКлассификаторовМедРегистра.Код = ""12""
	|	И ЭлементыКлассификаторовМедРегистра.Владелец = ЗНАЧЕНИЕ(Справочник.КлассификаторыМедРегистра.ArrayOfRecordTypeOut)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""УволенПоУсловиямДоговора"",
	|	ЭлементыКлассификаторовМедРегистра.Ссылка
	|ИЗ
	|	Справочник.ЭлементыКлассификаторовМедРегистра КАК ЭлементыКлассификаторовМедРегистра
	|ГДЕ
	|	ЭлементыКлассификаторовМедРегистра.Код = ""2""
	|	И ЭлементыКлассификаторовМедРегистра.Владелец = ЗНАЧЕНИЕ(Справочник.КлассификаторыМедРегистра.ArrayOfRecordTypeOut)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""УволенПоСобственномуЖеланию"",
	|	ЭлементыКлассификаторовМедРегистра.Ссылка
	|ИЗ
	|	Справочник.ЭлементыКлассификаторовМедРегистра КАК ЭлементыКлассификаторовМедРегистра
	|ГДЕ
	|	ЭлементыКлассификаторовМедРегистра.Код = ""3""
	|	И ЭлементыКлассификаторовМедРегистра.Владелец = ЗНАЧЕНИЕ(Справочник.КлассификаторыМедРегистра.ArrayOfRecordTypeOut)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ОкончаниеТрудовогоДоговора"",
	|	ЭлементыКлассификаторовМедРегистра.Ссылка
	|ИЗ
	|	Справочник.ЭлементыКлассификаторовМедРегистра КАК ЭлементыКлассификаторовМедРегистра
	|ГДЕ
	|	ЭлементыКлассификаторовМедРегистра.Код = ""4""
	|	И ЭлементыКлассификаторовМедРегистра.Владелец = ЗНАЧЕНИЕ(Справочник.КлассификаторыМедРегистра.ArrayOfRecordTypeOut)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ВыбылВДругуюСтрану"",
	|	ЭлементыКлассификаторовМедРегистра.Ссылка
	|ИЗ
	|	Справочник.ЭлементыКлассификаторовМедРегистра КАК ЭлементыКлассификаторовМедРегистра
	|ГДЕ
	|	ЭлементыКлассификаторовМедРегистра.Код = ""4""
	|	И ЭлементыКлассификаторовМедРегистра.Владелец = ЗНАЧЕНИЕ(Справочник.КлассификаторыМедРегистра.ArrayOfRecordTypeOutDel)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ВыбылВДругойСубъектРФ"",
	|	ЭлементыКлассификаторовМедРегистра.Ссылка
	|ИЗ
	|	Справочник.ЭлементыКлассификаторовМедРегистра КАК ЭлементыКлассификаторовМедРегистра
	|ГДЕ
	|	ЭлементыКлассификаторовМедРегистра.Код = ""3""
	|	И ЭлементыКлассификаторовМедРегистра.Владелец = ЗНАЧЕНИЕ(Справочник.КлассификаторыМедРегистра.ArrayOfRecordTypeOutDel)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		КлючевыеХарактеристики.Вставить(Выборка.Ключ, Выборка.Значение);
	КонецЦикла;
	
	Возврат КлючевыеХарактеристики;
	
КонецФункции

#КонецОбласти

#КонецЕсли
